f = @(x) 5/2*cos(2*x)*exp(2/3*x) + 4*sin(7/2*x)*exp(-3*x)+3*x;
p = @(x) (x-1/10)^(-1/5);
n = 3;
a_b = [0.1 2.3];
I = 3.578861536040539915439859609644293194417;
X = linspace (a_b(1),a_b(2),3);
% Ньютон-Котс метод:

% 1) простая ИКФ по трем узлам
 J_3nNC = dot(arrayfun(f,X), IQF(a_b,n, "NC"))

% % 2) составная ИКФ по шести узлам 
J_NC = CIQF(f, a_b, 2, 3, "NC")

% % 3) выбор оптимального числа узлов
k_opt = optCount(f,a_b,[2 3 5], "NC", I)

% % Гаусс метод:

% % 1) простая ИКФ по трем узлам

% % 2) составная ИКФ по шести узлам 
J_G = CIQF(f, a_b, 2, 3, "G")

% 3) выбор оптимального числа узлов
k_opt = optCount(f, a_b,[2 3 5], "G", I)

